MCUdude/MightyCore/avr/boards.txt
8535.menu.clock.8MHz_external=External 8 MHz
8535.menu.clock.8MHz_external.upload.speed=57600
8535.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.8MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.8MHz_external.build.f_cpu=8000000L

8535.menu.clock.7_3728MHz_external=External 7.3728 MHz
8535.menu.clock.7_3728MHz_external.upload.speed=115200
8535.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

8535.menu.clock.3_6864MHz_external=External 3.6864 MHz
8535.menu.clock.3_6864MHz_external.upload.speed=115200
8535.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

8535.menu.clock.1_8432MHz_external=External 1.8432 MHz
8535.menu.clock.1_8432MHz_external.upload.speed=115200
8535.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

8535.menu.clock.8MHz_internal=Internal 8 MHz
8535.menu.clock.8MHz_internal.upload.speed=38400
8535.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8535.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.8MHz_internal.build.f_cpu=8000000L

8535.menu.clock.1MHz_internal=Internal 1 MHz
8535.menu.clock.1MHz_internal.upload.speed=9600
8535.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8535.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.1MHz_internal.build.f_cpu=1000000L
